<?php
$lang['friendlyname'] = 'Галерея';
$lang['moddescription'] = 'Найпростіший спосіб керування та відображення галереї фотографій';
$lang['description'] = 'Проста у використанні галерея, яка автоматично показує зображення вибраної теки.';
$lang['postinstall'] = 'Модуль "Галерея" успішно встановлено';
$lang['tinymce_description_picker'] = 'Вибрати галерею фотографій для показу';
$lang['tinymce_button_picker'] = 'Вставити галерею';
$lang['active'] = 'Активно';
$lang['apply'] = 'Застосувати';
$lang['areyousure'] = 'Ви впевнені, що хочете видалити?';
$lang['areyousuremulti'] = 'Ви впевнені, що хочете виконати цю масову дію?';
$lang['cancel'] = 'Скасувати';
$lang['copy'] = 'Копіювати';
$lang['default'] = 'За замовчуванням';
$lang['delete'] = 'Видалити';
$lang['down'] = 'Вниз';
$lang['edit'] = 'Редагувати';
$lang['error'] = 'Помилка!';
$lang['inactive'] = 'Неактивний';
$lang['setfalse'] = 'Встановити False';
$lang['settrue'] = 'Встановити True';
$lang['submit'] = 'Зберегти';
$lang['up'] = 'Вверх';
$lang['gallerymenu'] = 'Меню галереї';
$lang['galleries'] = 'Галереї';
$lang['gallerypath'] = 'Шлях';
$lang['dirtag'] = 'Теґ для відображення цієї підгалереї';
$lang['editgallery'] = 'Редагувати галерею';
$lang['addsubgallery'] = 'Додати підгалерею';
$lang['uploadimages'] = 'Вивантажити зображення';
$lang['editimage'] = 'Редагувати інформацію про зображення';
$lang['editthumbs'] = 'Редагувати ескізи';
$lang['nogalleriestext'] = 'Немає доступних галерей';
$lang['list'] = 'Список';
$lang['item'] = 'Зображення';
$lang['title'] = 'Заголовок';
$lang['date'] = 'Дата';
$lang['nofilestext'] = 'Немає доступних зображень';
$lang['directoryname'] = 'Нова назва теки';
$lang['gallerytitle'] = 'Заголовок галереї';
$lang['comment'] = 'Коментар';
$lang['albumcover'] = 'Обкладинка альбому';
$lang['noalbumcover'] = 'Підгалерея не має обкладинки альбому';
$lang['template'] = 'Шаблон';
$lang['editors'] = 'Редактори';
$lang['parentgallery'] = 'Батьківська галерея';
$lang['hideparentlink'] = 'Сховати посилання на батьківську галерею';
$lang['usedefault'] = 'використовувати за замовчуванням';
$lang['sortbysettings'] = 'Сортувати за параметрами шаблону';
$lang['sureunsort'] = 'Ви впевнені, що хочете видалити ручний порядок сортування?';
$lang['updatethumbs'] = 'Оновити ескізи';
$lang['sureupdatethumbs'] = 'Ви впевнені, що хочете видалити ескізи?';
$lang['thumbsrecreated'] = 'Вони будуть створені наново під час першого відвідування галереї';
$lang['thumbsdeleted'] = 'Ескізи видалено.';
$lang['galleryupdated'] = 'Галерею успішно оновлено.';
$lang['withselected'] = 'З обраними';
$lang['moveto'] = 'Перемістити до';
$lang['imageupdated'] = 'Зображення оновлено.';
$lang['imagedetailsupdated'] = 'Інформацію про зображення оновлено.';
$lang['thumbupdated'] = 'Ескіз оновлено.';
$lang['error_insufficientparams'] = 'Відсутні обов\'язкові параметри.';
$lang['error_updategalleryfailed'] = 'Не вдалося оновити галерею.';
$lang['error_directorynameinvalid'] = 'Ім\'я теки недійсне.';
$lang['error_directoryalreadyexists'] = 'Така тека вже існує.';
$lang['templates'] = 'Шаблони';
$lang['title_available_templates'] = 'Доступні шаблони';
$lang['prompt_name'] = 'Назва';
$lang['prompt_version'] = 'Версія';
$lang['prompt_about'] = 'Довідка';
$lang['prompt_default'] = 'За замовчуванням';
$lang['prompt_visible'] = 'Відображається у випадаючому списку шаблонів';
$lang['prompt_newtemplate'] = 'Створити новий шаблон';
$lang['makevisible'] = 'Зробити видимим у випадаючому списку шаблонів для користувачів без дозволу \'Modify Templates\'';
$lang['makeinvisible'] = 'Приховати у випадаючому списку шаблонів для користувачів без дозволу \'Modify Templates\'';
$lang['title_importxml'] = 'Імпортувати XML-файл шаблону';
$lang['importxmlnote'] = 'XML-файли, що містять різні шаблони галереї, можна знайти на сторінці проекту <a href="http://dev.cmsmadesimple.org/project/files/726" target="_blank">Gallery page</a>. Прочитайте інформацію перед завантаженням!';
$lang['importxml'] = 'Імпортувати XML-файл шаблону';
$lang['overwrite'] = 'Перезаписати існуючі шаблони модулів';
$lang['title_singleimg_template'] = 'Шаблон виклику модуля для одного зображення';
$lang['title_template'] = 'Редактор шаблону';
$lang['prompt_templatename'] = 'Назва шаблону';
$lang['thumbnailsize'] = 'Розмір ескізу (фронтенд)';
$lang['leaveempty'] = '(залиште це поле порожнім, щоб використовувати ескізи за замовчуванням з ImageManager)';
$lang['width'] = 'ширина';
$lang['height'] = 'висота';
$lang['resizemethod'] = 'метод зміни розміру';
$lang['crop'] = 'обрізати';
$lang['scale'] = 'масштабувати';
$lang['zoomcrop'] = 'збільшити & обрізати';
$lang['zoomscale'] = 'збільшити & масштабувати';
$lang['maxnumber'] = 'Максимальна кількість елементів на сторінці';
$lang['showallimages'] = 'Якщо залишити порожнім, буде показано всі зображення на одній сторінці';
$lang['sortingoptions'] = 'Параметри сортування';
$lang['specifysortfields'] = 'Вкажіть поле(я) для сортування';
$lang['ascending'] = 'за зростанням';
$lang['descending'] = 'за спаданням';
$lang['addfield'] = 'Додати поле';
$lang['deletefield'] = 'Видалити останній рядок';
$lang['prompt_template'] = 'Джерело шаблону';
$lang['prompt_templatecss'] = 'Шаблон таблиці стилів CSS';
$lang['prompt_templatejs'] = 'Шаблон JavaScript';
$lang['jsposition'] = 'Де вставити JavaScript';
$lang['jstop'] = 'в блок ‹head› сторінки';
$lang['jsbtm'] = 'в кінці блоку ‹body› сторінки';
$lang['resetoriginal'] = 'Скинути до початкового значення';
$lang['resetoriginalwarning'] = 'Ви впевнені, що хочете скинути код шаблону до його початкового значення?';
$lang['templateupdated'] = 'Шаблон успішно оновлено';
$lang['templateadded'] = 'Шаблон успішно додано';
$lang['error_templateexists'] = 'Такий шаблон модуля вже існує і не буде перезаписаний.';
$lang['error_directorynotwritable'] = 'Тека не доступна для запису.';
$lang['error_incompletexml'] = 'Неповний xml.';
$lang['error_cantcreatedir'] = 'Неможливо створити теку';
$lang['error_cantcreatefile'] = 'Неможливо створити файл';
$lang['templatedeleted'] = 'Шаблон видалено';
$lang['availablevariables'] = 'Доступні змінні Smarty у шаблоні';
$lang['availablevariableslist'] = 'Це змінні, які ви можете використовувати для налаштування вашого шаблону:<br /><br />
<code>{$module_message}</code> - повідомлення про помилку, встановлюється тільки тоді, якщо є повідомлення<br />
<code>{$galleryid}</code> - унікальний id для галереї<br />
<code>{$gallerytitle}</code> - назва галереї. Якщо заголовок відсутній, буде показуватися назва теки<br />
<code>{$gallerycomment}</code> - коментар до галереї<br />
<code>{$gallerydate}</code> - коментар про дату/час створення галереї<br />
<code>{$gallerydir}</code> - назва теки галереї<br />
<code>{$parentid}</code> - id для батьківської галереї (лише в дії за замовчуванням)<br />
<code>{$parentlink}</code> - посилання на батьківську теку<br />
<code>{$parent_url}</code> - url-адреса до батьківської теки<br />
<code>{$parent_txt}</code> -текст для створення посилання з url-адресою вище<br />
<code>{$hideparentlink}</code> - true/false<br />
<code>{$imagecount}</code> - показує, наприклад, "6 зображень", залежно від мови<br />
<code>{$itemcount}</code> - кількість елементів, зображення + теки<br />
<code>{$numimages}</code> - кількість зображень<br />
<code>{$numdirs}</code> - кількість тек<br />
<code>{$pages}</code> - кількість сторінок<br />
<code>{$currentpage}</code> - номер поточної сторінки<br />
<code>{$prevpage}</code> - посилання на попередню сторінку, якщо така є<br />
<code>{$prevpage_url}</code> - URL-адреса на попередню сторінку, якщо така є<br />
<code>{$prevpage_txt}</code> - текст для створення посилання з url-адресою вище <br />
<code>{$nextpage}</code> - посилання на наступну сторінку, якщо така є<br />
<code>{$nextpage_url}</code> - URL-адреса на наступну сторінку, якщо така є<br />
<code>{$nextpage_txt}</code> - текст для створення посилання з url-адресою вище <br />
<code>{$pagelinks}</code> - посилання на кожну існуючу сторінку<br />
<code>{$fields.your_field_alias.name}</code> - назва додаткового поля галереї<br />
<code>{$fields.your_field_alias.value}</code> - значення додаткового поля галереї<br />
<code>{$fields.your_field_alias.type}</code> - тип додаткового поля галереї<br />
<code>{$images}</code> - масив з ключами:<br />
 - <code>file</code> - відносний шлях до оригінального зображення (або підгалереї)<br /> 
 - <code>filename</code> - назва файлу зображення (або підгалереї)<br />
 - <code>title</code> - назва зображення<br />
 - <code>titlename</code> - показує назву, якщо така є, або ім\'я файлу<br />
 - <code>comment</code> - коментар до зображення<br />
 - <code>active</code> - true/false<br />
 - <code>filedate</code> - дата/час створення<br />
 - <code>thumb</code> - відносний шлях до ескізу. У випадку підгалереї - до зображення, яке в цій підгалереї встановлено як обкладинка альбому. Якщо не встановлено обкладинку альбому, буде використано стандартний значок теки.<br />
 - <code>fileid</code> -  унікальний id для зображення чи підгалереї<br />
 - <code>isdir</code> - true, якщо це підгалерея<br />
 - <code>galleryid</code> - id галереї, до якої належить зображення<br />
 - <code>gallery_url</code> - URL-адреса галереї, до якої належить зображення<br />
 - <code>fields.your_field_alias.name</code> - назва додаткового поля<br />
 - <code>fields.your_field_alias.value</code> - значення додаткового поля<br />
 - <code>fields.your_field_alias.type</code> - тип додаткового поля<br />';
$lang['fielddefinitions'] = 'Типи полів';
$lang['fielddefinition'] = 'Поле';
$lang['addfielddef'] = 'Додати поле';
$lang['editfielddef'] = 'Редагувати поле';
$lang['alias'] = 'Псевдонім';
$lang['type'] = 'Тип';
$lang['textinput'] = 'Текстове поле';
$lang['dropdown'] = 'Випадаючий список';
$lang['checkbox'] = 'Прапорець';
$lang['radiobuttons'] = 'Радіокнопки';
$lang['textarea'] = 'Текстова область';
$lang['wysiwyg'] = 'Візуальний редактор';
$lang['file'] = 'Файл';
$lang['properties'] = 'Властивості поля';
$lang['properties_help'] = 'Максимальна кількість символів для текстового поля або список значень через кому для поля випадаючого списку або радіокнопок';
$lang['public'] = 'Публічне';
$lang['dirfield'] = 'Застосувати поле до';
$lang['fielddefadded'] = 'Поле додано';
$lang['fielddefsupdated'] = 'Список типів полів оновлено';
$lang['options'] = 'Параметри';
$lang['urlprefix'] = 'Префікс для використання у всіх URL-адресах, що генеруються модулем "Галерея"';
$lang['urlprefix_help'] = 'Це стосується лише тих випадків, коли увімкнено pretty URL-адреси за допомогою mod_rewrite або internal';
$lang['allowed_extensions'] = 'Дозволені розширення';
$lang['maxsize'] = 'Змінити розмір зображень до вказаних максимальних значень під час вивантаження';
$lang['imagejpgquality'] = 'Якість jpg під час зміни розміру зображень';
$lang['thumbjpgquality'] = 'Якість jpg під час зміни розміру ескізів';
$lang['jpgquality_help'] = '(1 - 100)';
$lang['searchimages'] = 'Шукати окремі зображення замість підгалерей';
$lang['use_permissions'] = 'Вимагати дозволи на редагування підгалерей';
$lang['newgalleries_active'] = 'Нові галереї активні за замовчуванням';
$lang['use_comment_wysiwyg'] = 'Використовувати візуальний редактор для поля "коментар" в Галереї';
$lang['editdirdates'] = 'Дозволити користувачам редагувати дати створення підгалерей';
$lang['editfiledates'] = 'Дозволити користувачам редагувати дати файлів зображень';
$lang['fe_folderpath'] = 'Шлях за замовчуванням до піктограми теки у фронтенді';
$lang['be_folderpath'] = 'Шлях до піктограми теки в адмін. панелі';
$lang['optionsupdated'] = 'Параметри успішно оновлено.';
$lang['rotateclockwise'] = 'Повернути за годинниковою стрілкою';
$lang['rotateanticlockwise'] = 'Повернути проти годинникової стрілки';
$lang['editthumb_help'] = 'Натисніть і перетягніть, щоб вибрати область зображення';
$lang['thumb_current'] = 'Поточний ескіз';
$lang['thumb_preview'] = 'Попередній перегляд ескізу';
$lang['image'] = 'зображення';
$lang['images'] = 'зображення';
$lang['parent'] = 'Повернутися до батьківської галереї';
$lang['prevpage'] = 'Попередня';
$lang['nextpage'] = 'Наступна';
$lang['defaultgallerycomment'] = 'Дякуємо, що встановили модуль "Галерея". Якщо ви завантажили деякі зображення до теки \'uploads/images/Gallery\', ви побачите їх нижче. Ви можете редагувати заголовки, описи та розміри ескізів у адмін. панелі. Ознайомтеся з усіма іншими функціями цього модуля в довідці модуля.';
$lang['message_wrongdir'] = 'Теки \'Gallery/%s\' не існує. Перевірте свої параметри.';
$lang['help_dir'] = 'Параметр, що вказує теку, відносну до uploads/images/Gallery/';
$lang['help_template'] = 'Використовуйте окремий шаблон бази даних для відображення галереї фотографій. Цей шаблон повинен існувати та бути видимим на вкладці "Шаблони", хоча він не обов\'язково повинен бути за замовчуванням. Якщо цей параметр не вказано, буде використано шаблон, який призначений для теки (галереї). Якщо його не призначено, то шаблон за замовчуванням.';
$lang['help_targetpage'] = 'Сторінка для відображення Галереї. Це може бути id або псевдонім сторінки. Використовується для відображення Галереї на сторінці з іншим шаблоном.';
$lang['help_number'] = 'Максимальна кількість ескізів для відображення (на сторінці). Якщо поле порожнє, то буде показано всі зображення.';
$lang['help_start'] = 'Почати з n-го зображення - якщо поле порожнє, то буде показано з першого зображення.';
$lang['help_show'] = 'Перевизначити, які саме зображення показувати. Можливі значення:
<ul>
<li>\'active\' - відображати зображення, позначені як активні (за замовчуванням) </ li>
<li>\'inactive\' - відображати лише зображення, позначені як неактивні </li>
<li>\'all\' - для відображення всіх зображень </ li>
</ ul>';
$lang['help_action'] = 'Перевизначити дію за замовчуванням. Використовуйте її в поєднанні з наведеними вище параметрами. Можливі значення:
<ul>
<li>\'showrandom\' - відображати набір випадкових ескізів (застосовується лише до зображень, які зберігаються в базі даних, за замовчуванням - до 6 зображень). Використовуйте \'/*\' після назви теки в параметрі dir, щоб включити зображення з підтек</li> 
<li>\'showlatest\' - відображати останні додані зображення (застосовується лише до зображень, які зберігаються в базі даних, за замовчуванням - до 6 зображень). Можна встановити параметр dir, або буде використано кореневу галерею за замовчуванням. Підтеки автоматично включаються</li>
<li>\'showlatestdir\' - відображати набір випадкових ескізів з останньої доданої теки (застосовується лише до зображень, які зберігаються в базі даних, за замовчуванням - до 6 зображень)</li>
<li>\'gallerytree\' - відображати посилання на всі галереї та підгалереї. За замовчуванням використовується шаблон gallerytree, але його можна змінити за допомогою параметра template. Використовуйте параметр dir, щоб відобразити підмножину gallerytree. (застосовується лише до галерей, які зберігаються в базі даних)</li>
</ul>
Зверніть увагу, що зображення зберігаються в базі даних лише тоді, коли конкретна галерея відвідана у адмін. панелі або у фронтенді.';
$lang['help_loadcustomfields'] = 'Тільки для використання з action=\'gallerytree\'. Встановіть цьому параметру значення 1, якщо ви хочете використовувати додаткові поля в шаблоні gallerytree.';
$lang['help_img'] = 'Викликайте одне зображення за допомогою <code>{Gallery img=123}</code>. Вивід html можна змінити на вкладці шаблонів. Розмір ескізу  та обробник JavaScript можна встановити, вибравши шаблон з випадаючого списку';
?>